---
kind: property
id: P:Autodesk.Revit.DB.UnitTypeId.MeganewtonsPerMeter
source: html/b477c5e6-2751-85db-f6bc-5d726c9144ed.htm
---
# Autodesk.Revit.DB.UnitTypeId.MeganewtonsPerMeter Property

Meganewtons per meter.

## Syntax (C#)
```csharp
public static ForgeTypeId MeganewtonsPerMeter { get; }
```